app/controllers/birthdays_controller.rb

  def index
    @birthdays = Birthday.all
---
SELECT "birthdays".* FROM "birthdays"

  def update
    x =  params[:id].size - 1

    for i in 0..x
      x = Birthday.where("id = #{params[:id][i]} and dia = #{params[:dia][i]}")
      x.update_all("mes = #{params[:mes][i]} and ano = #{params[:ano][i]}")
---
SELECT  "birthdays".* FROM "birthdays" WHERE "birthdays"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "birthdays" SET mes = 1 and ano = 2 WHERE (id = 1 and dia = 456)