app/controllers/coins_controller.rb

SELECT "coins".* FROM "coins"
---
  def index
    @coins = Coin.all

INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @coin = Coin.new(coin_params)

    respond_to do |format|
      if @coin.save

UPDATE "coins" SET "mining_type_id" = ?, "updated_at" = ? WHERE "coins"."id" = ?  [["mining_type_id", 1], ["updated_at", "2018-12-05 13:29:54.130404"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @coin.update(coin_params)

SELECT "mining_types"."description", "mining_types"."id" FROM "mining_types"
---
    def set_mining_type_options
      @mining_type_options = MiningType.all.pluck( :description, :id )

SELECT  "coins".* FROM "coins" WHERE "coins"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_coin
      @coin = Coin.find(params[:id])