app/controllers/eventos_controller.rb

SELECT "eventos".* FROM "eventos"
---
  def index
    @eventos = Evento.all

INSERT INTO "eventos" ("nome", "local", "inicio", "termino", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @evento = Evento.new(evento_params)

    if @evento.save

SELECT  "eventos".* FROM "eventos" WHERE "eventos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_evento
      @evento = Evento.find(params[:id])